# 下标表达式

下标表达式可以过滤列表内的元素，常用于`YIELD`和`RETURN`子句中。

## 语法

```ngql
[M]
[M..N]
[M..]
[..N]
```

nGQL的下标支持从前往后查询，从0开始，0表示第一个元素，1表示第二个元素，以此类推；也支持从后往前查询，从-1开始，-1表示最后一个元素，-2表示倒数第二个元素，以此类推。

- [M]：表示下标为M的元素。
- [M..N]：表示`M ≤ 下标 ＜ N`的元素。`N`为0时，返回为空。
- [M..]：表示`M ≤ 下标`的元素。
- [..N]：表示`下标 ＜ N`的元素。`N`为0时，返回为空。

!!! note

    - 越界的下标返回为空。
    - `M`≥`N`时，返回为空。
    - 下标存在null时，返回为null。

## 示例

```ngql
# 返回列表内下标为0、1的元素。
nebula> YIELD [1, 2, 3][0..2] AS r;
+--------+
| r      |
+--------+
| [1, 2] |
+--------+

# 返回列表内第一个至倒数第二个（包括）的元素。
nebula> YIELD [1, 2, 3][0..-1] AS r;
+--------+
| r      |
+--------+
| [1, 2] |
+--------+

# 返回列表内倒数第三个至倒数第一个（不包括）的元素。
nebula> YIELD [1, 2, 3, 4, 5][-3..-1] AS r;
+--------+
| r      |
+--------+
| [3, 4] |
+--------+

# 设置变量，返回列表内下标为1、2的元素。
nebula> $var = YIELD 1 AS f, 3 AS t; \
        YIELD [1, 2, 3][$var.f..$var.t] AS r;
+--------+
| r      |
+--------+
| [2, 3] |
+--------+

# 返回列表内下标≥2的元素。
nebula> WITH [1, 2, 3, 4, 5] AS list \
        RETURN list[2..] AS r;
+-----------+
| r         |
+-----------+
| [3, 4, 5] |
+-----------+

# 返回列表内下标＜3的元素。
nebula> WITH [1, 2, 3, 4, 5] AS list \
        RETURN list[..3] AS r;
+-----------+
| r         |
+-----------+
| [1, 2, 3] |
+-----------+

# 越界的下标返回为空。
nebula> RETURN [1, 2, 3, 4, 5] [0..10] AS r;
+-----------------+
| r               |
+-----------------+
| [1, 2, 3, 4, 5] |
+-----------------+

nebula> RETURN [1, 2, 3] [-5..5] AS r;
+-----------+
| r         |
+-----------+
| [1, 2, 3] |
+-----------+

# [0..0]时返回为空。
nebula> RETURN [1, 2, 3, 4, 5] [0..0] AS r;
+----+
| r  |
+----+
| [] |
+----+

# M ≥ N时，返回为空。
nebula> RETURN [1, 2, 3, 4, 5] [3..1] AS r;
+----+
| r  |
+----+
| [] |
+----+

# 下标有null时，返回为null。
nebula> WITH [1,2,3] AS list \
        RETURN list[0..null] as r;
+----------+
| r        |
+----------+
| __NULL__ |
+----------+
```
